// <button id="helloBtn"></button>
/*
Анонимная функция
1. При клике по кнопке вызвать модальное окно alert. (click, on)
2. При клике по кнопке вызвать модальное окно alert. При помощи делегирования. (on)
3. То же что и 2. Только исспользовать синтаксис объекта. $().on({}, 'delegateSelector');

Несколько событий
4. При клике и при наведении миши вывести сообщение в консоль. (Одинаковое действие, для разных событий)
5. При клике и при наведении миши вывести сообщение в консоль.
При помощи делегирования и синтаксиса объекта. (on);

Именованя функция
6. При клике по кнопке вызвать модальное окно alert. (showAlert)
*/

// <form action=""></form>
/*
7. Отменить отправку формы по умолчанию (+ альтернативный метод)
8. Прекратить всплытие
*/

// <button id="helloBtn"></button>
/*
9. Получить объект по которому кликнули.
10. Получить jquery объект по которому кликнули. (для делегирования)
11. Получить jquery объект на котором обработчик события (делегирование)
12. Получить тип события

13. При клике по кнопке вызвать модальное окно alert. Один раз.

14. Удалить все обработчики события с элемента button
15. Удалить все обработчики события click с элемента button
16. Удалить обработчик события showAlert (click) с элемента button
17. Удалить обработчик события showAlert (click) с элемента button,
делегирование было назначено элементу "body"

18. Удалить все клики относящиеся к вашему "плагину", "модулю" (myModule)
19. Удалить все события относящиеся к вашему "плагину", "модулю" (myModule)

20. Исспользуя код с п.6, передать данные (объект {msg: 'Hello'}) в функцию обработчик события
21. В функции обработчике события, получить данные из п20

22. Вызвать событие click на элементе button
23. Вызвать кастомное событие (showAlert)
24. Вызвать кастомное событие (showAlert) и передать данные объект {msg: 'Hello'}
25. В функции обработчике взять данные переданые из п24

*/