'mouseover' // Проиcходит когда мышь появляется над элементом
'mouseout' // Проиcходит когда мышь уходит с элемента

'mouseover'
'event.target' // элемент, на который пришла мышь, то есть на котором возникло событие.
'event.relatedTarget' //элемент, с которого пришла мышь.


'mouseout'
'event.target' //элемент, с которого пришла мышь.
'event.relatedTarget' // элемент, на который пришла мышь, то есть на котором возникло событие.

/***********/

'mouseenter/mouseleave'
/*
 Не учитываются переходы внутри элемента.
 События mouseenter/mouseleave не всплывают.
* */